// type:
// - "caravan"     : 자가 카라반존 1~7
// - "cabana"      : 카바나데크존 1~8
// - "camp"        : 일반 캠핑 사이트 (A, B, E, F)
// - "room"        : 숙박시설 (D동 1~14)

export const sites = [
  // =============================
  // 자가 카라반존 (1~7)
  // =============================
  {id: 'CAR7', type: 'caravan', x: 38, y: 90.5},
  {id: 'CAR6', type: 'caravan', x: 42, y: 90.5},
  {id: 'CAR5', type: 'caravan', x: 46, y: 90.5},
  {id: 'CAR4', type: 'caravan', x: 50, y: 90.5},
  {id: 'CAR3', type: 'caravan', x: 54, y: 90.5},
  {id: 'CAR2', type: 'caravan', x: 58, y: 90.5},
  {id: 'CAR1', type: 'caravan', x: 62, y: 90.5},


  // =============================
  // 카바나 데크존 (1~8)
  // =============================

  {id: 'CAB8', type: 'cabana', x: 34, y: 78},
  {id: 'CAB7', type: 'cabana', x: 38, y: 78},
  {id: 'CAB6', type: 'cabana', x: 42, y: 78},
  {id: 'CAB5', type: 'cabana', x: 45.5, y: 78},
  {id: 'CAB4', type: 'cabana', x: 49.5, y: 78},
  {id: 'CAB3', type: 'cabana', x: 53, y: 78},
  {id: 'CAB2', type: 'cabana', x: 57, y: 78},
  {id: 'CAB1', type: 'cabana', x: 61, y: 78},

  // =============================
  // 캠핑 사이트 A1 ~ A12 (하단 우측)
  // =============================
  {id: 'A1', type: 'camp', x: 75, y: 92},
  {id: 'A2', type: 'camp', x: 82, y: 90},
  {id: 'A3', type: 'camp', x: 85, y: 90},
  {id: 'A4', type: 'camp', x: 75, y: 86},
  {id: 'A5', type: 'camp', x: 78, y: 86},
  {id: 'A6', type: 'camp', x: 81, y: 86},
  {id: 'A7', type: 'camp', x: 72, y: 81},
  {id: 'A8', type: 'camp', x: 75, y: 81},
  {id: 'A9', type: 'camp', x: 78, y: 81},
  {id: 'A10', type: 'camp', x: 71, y: 76},
  {id: 'A11', type: 'camp', x: 74, y: 75.5},
  {id: 'A12', type: 'camp', x: 77, y: 75},



  // =============================
  // 캠핑 사이트 B1 ~ B19 (A 위쪽 열)
  // =============================
  {id: 'B1', type: 'camp', x: 70.2, y: 72},
  {id: 'B2', type: 'camp', x: 73.5, y: 71},
  {id: 'B3', type: 'camp', x: 77, y: 70.5},
  {id: 'B4', type: 'camp', x: 70, y: 66.5},
  {id: 'B5', type: 'camp', x: 73, y: 66},
  {id: 'B6', type: 'camp', x: 76, y: 65.5},
  {id: 'B7', type: 'camp', x: 72.89663461538461, y: 62.24420110679383},
  {id: 'B8', type: 'camp', x: 76.92307692307693, y: 61.56599552572707},
  {id: 'B9', type: 'camp', x: 81.00961538461539, y: 60.88778994466031},
  {id: 'B10', type: 'camp', x: 72.41586538461539, y: 57.64747439067467},
  {id: 'B11', type: 'camp', x: 76.08173076923077, y: 56.89391263393383},
  {id: 'B12', type: 'camp', x: 79.98798076923077, y: 55.83892617449664},
  {id: 'B13', type: 'camp', x: 71.51442307692307, y: 53.20146002590369},
  {id: 'B14', type: 'camp', x: 75.24038461538461, y: 52.1464735664665},
  {id: 'B15', type: 'camp', x: 79.0264423076923, y: 50.94077475568115},
  {id: 'B16', type: 'camp', x: 70.37259615384616, y: 48.45402095843636},
  {id: 'B17', type: 'camp', x: 74.21875, y: 46.946897444954665},
  {id: 'B18', type: 'camp', x: 68.6298076923077, y: 44.30943129636171},
  {id: 'B19', type: 'camp', x: 71.7548076923077, y: 41.29518426939833},


  // =============================
  // 캠핑 사이트 E1 ~ E7 (좌측 중간 세로)
  // =============================
  {id: 'E1', type: 'camp', x: 37.92067307692308, y: 19.818674202284235},
  {id: 'E2', type: 'camp', x: 38.28125, y: 23.661839161662545},
  {id: 'E3', type: 'camp', x: 38.762019230769226, y: 27.128223242670437},
  {id: 'E4', type: 'camp', x: 39.24278846153847, y: 30.820675850700578},
  {id: 'E5', type: 'camp', x: 39.48317307692308, y: 34.43777228305663},
  {id: 'E6', type: 'camp', x: 39.362980769230774, y: 38.507005769457194},
  {id: 'E7', type: 'camp', x: 39.00240384615385, y: 42.425526904509596},
  // =============================
  // 캠핑 사이트 F1 ~ F3 (E 오른쪽, 중앙)
  // =============================
  {id: 'F1', type: 'camp', x: 55.22836538461539, y: 26.22394913458142},
  {id: 'F2', type: 'camp', x: 58.35336538461539, y: 28.40927822912987},
  {id: 'F3', type: 'camp', x: 60.637019230769226, y: 31.197456729071},

  // =============================
  // 숙박시설 D1 ~ D14 (상단 검은 건물)
  // =============================
  {id: 'D1', type: 'room', x: 50, y: 25},
  {id: 'D2', type: 'room', x: 54, y: 24},
  {id: 'D3', type: 'room', x: 58, y: 23},
  {id: 'D4', type: 'room', x: 62, y: 22},
  {id: 'D5', type: 'room', x: 66, y: 21},
  {id: 'D6', type: 'room', x: 46, y: 26},
  {id: 'D7', type: 'room', x: 39, y: 18},
  {id: 'D8', type: 'room', x: 42.5, y: 17},
  {id: 'D9', type: 'room', x: 45.5, y: 15},
  {id: 'D10', type: 'room', x: 49, y: 13},
  {id: 'D11', type: 'room', x: 53, y: 11},
  {id: 'D12', type: 'room', x: 57, y: 9},
  {id: 'D13', type: 'room', x: 61, y: 7},
  {id: 'D14', type: 'room', x: 65, y: 5},
];
